In [1]:
import pandas as pd;

In [2]:
data = {
    'name':['vishal', 'om', 'shubz', 'Huzepa', 'mayur'],
    'age':[21,22,21,33,23], 
    'department':['computer', 'IT', 'Ai-ML', 'cs', 'Chemical'], 
    'salary':[22222,4444333,55555,222222,444444]
}

df = pd.DataFrame(data)
df

     name  age department   salary
0  vishal   21   computer    22222
1      om   22         IT  4444333
2   shubz   21      Ai-ML    55555
3  Huzepa   33         cs   222222
4   mayur   23   Chemical   444444

In [3]:
df['Date'] = ['2004-04-33', '2023-12-01', '2023-11-12', '2022-10-24', '2023-11,10']

In [4]:
df

     name  age department   salary        Date
0  vishal   21   computer    22222  2004-04-33
1      om   22         IT  4444333  2023-12-01
2   shubz   21      Ai-ML    55555  2023-11-12
3  Huzepa   33         cs   222222  2022-10-24
4   mayur   23   Chemical   444444  2023-11,10

In [5]:
df['department'].value_counts()

department
computer    1
IT          1
Ai-ML       1
cs          1
Chemical    1
Name: count, dtype: int64

In [8]:
df[df['name'] == 'vishal'].value_counts()

name    age  department  salary  Date
vishal  21   computer    22222   2004-04-33    1
Name: count, dtype: int64

In [9]:
df.groupby('department')['salary'].sum()

department
Ai-ML         55555
Chemical     444444
IT          4444333
computer      22222
cs           222222
Name: salary, dtype: int64

In [10]:
df.groupby(['name', 'salary'])['salary'].sum()

name    salary
Huzepa  222222      222222
mayur   444444      444444
om      4444333    4444333
shubz   55555        55555
vishal  22222        22222
Name: salary, dtype: int64

In [11]:
df.groupby('department').agg({'salary':'mean', 'name':'count'})

               salary  name
department
Ai-ML         55555.0     1
Chemical     444444.0     1
IT          4444333.0     1
computer      22222.0     1
cs           222222.0     1